/*****************************************************************************
*      Abilita.c -File di implemetazione delle abilita su DalilaMud.         *
*                                                                            *
*     Written by Enrico Lazzaretto.   Basato sulle idee di Offar e Blizzard  *
*     Questo file e' proprieta esclusiva dello staff di DalilaMud            *
*****************************************************************************/

#include "conf.h"
#include "sysdep.h"
#include "structs.h"
#include "utils.h"
#include "comm.h"
#include "handler.h"
#include "spells.h"
#include "interpreter.h"
#include "db.h"
//#include "olc.h"
#include "abilita.h"
#include "house.h"
#include "screen.h"

void check_trap_danno (struct char_data *ch, struct obj_data *trap);
void check_trap_stun (struct char_data *ch, struct obj_data *trap);
void check_trap_bash (struct char_data *ch, struct obj_data *trap);
void check_trap_allarme (struct char_data *ch, struct obj_data *trap, int tracce);
void piazza_trap_danno (struct char_data *ch, struct obj_data *trappola);
void piazza_trap_stun (struct char_data *ch, struct obj_data *trappola);
void piazza_trap_bash (struct char_data *ch, struct obj_data *trappola);
void piazza_trap_allarme (struct char_data *ch, struct obj_data *trappola);
int rimuovi_trappola (struct char_data *ch, struct obj_data *trappola);

/* external vars */
extern struct obj_data *object_list;
extern struct char_data *character_list;
extern struct index_data *mob_index;
extern struct index_data *obj_index;
extern struct descriptor_data *descriptor_list;
extern struct abil_info_type abil_info[];
extern struct room_data *world;
extern struct house_control_rec house_control[MAX_HOUSES];

/* external func*/
extern void xp_gain(struct char_data *ch,struct char_data *victim,int missile,struct char_data *tank);
extern void die(struct char_data * ch, struct char_data *killer);
extern int get_clan_by_id(long id);
extern void set_crime(struct char_data *ch, struct char_data *vict,char *vivomorto,char *descr, int clan_num, int flag, long taglia);
extern void	store_mail(long to, long from, char *message_pointer);
extern int apply_ac(struct char_data * ch, int eq_pos);
extern char *two_arguments(char *argument, char *first_arg, char *second_arg);
extern int find_house(room_vnum vnum);
extern int newbye(struct char_data *ch);

int check_abil_weapon(struct obj_data *weapon){
	int messag=0;//,dammod=0,liv=0;
	if (weapon !=NULL ){
		messag =GET_OBJ_VAL(weapon,3)+300;
		switch( messag  ){
			case TYPE_STING: return ABIL_PUGNALE;  /*301*/
			case TYPE_SLASH: return ABIL_ASCIA;    /*303*/
			case TYPE_BLUDGEON: return ABIL_MAZZA; /*305*/
			case TYPE_CRUSH: return ABIL_MAZZA;    /*306*/
			case TYPE_POUND: return ABIL_LANCIA;   /*307*/
			case TYPE_MAUL: return ABIL_MAZZA;     /*309*/
			case TYPE_THRASH: return ABIL_SPADA;   /*310*/
			case TYPE_PIERCE: return ABIL_LANCIA;  /*311*/
			case TYPE_BLAST: return ABIL_SPADA;    /*312*/
			case TYPE_STAB: return ABIL_PUGNALE;   /*314*/
			case TYPE_SLAY: return ABIL_ASCIA;     /*315*/
			default: return 0; break;
		}
	}
	return 0;
}

int check_abil_armor(struct obj_data *armour){
	int abil=0,ac=0,wear=0;
	if (!(GET_OBJ_TYPE(armour) == ITEM_ARMOR))
		return 0;
	ac=GET_OBJ_VAL(armour, 0);
	wear=GET_OBJ_WEAR(armour);
	if(CAN_WEAR(armour, ITEM_WEAR_SHIELD))
		abil= ABIL_SCUDO;
	if(CAN_WEAR(armour, ITEM_WEAR_BODY)){ 
		if(ac <= 14)
			abil= ABIL_ARM_MEDIA;
		else  
			abil= ABIL_ARM_PESANTE;    
		if(ac <= 7) 
			abil= ABIL_ARM_BASE;
	}
	return abil;
}  

void check_abil_obj(struct char_data *ch,struct obj_data *obj,bool wear){
	int mod=0,abil=0,liv=0;
	if(IS_NPC(ch)||(!ch)||(!obj))
		return;
	switch(GET_OBJ_TYPE(obj)){
		case ITEM_WEAPON:
		case ITEM_WEAPON_2HANDS:
			if(((liv=GET_ABIL(ch,(abil=check_abil_weapon(obj))))!=0) && CAN_LEARN_ABIL(ch, abil)){
				mod=abilita_vector[abil][liv];	  
				affect_modify(ch,APPLY_DAMROLL,mod,0,0,0,0,wear);
			}
			break;
		case ITEM_ARMOR:
